//向电脑屏幕输出图案
// 姓名：***
// 学号：***************
// ---------------------------
// 唐诗一首
// ---------------------------
#include <iostream>		 				//包含头文件isostream
using namespace std;						//使用c++的命名空间std
int main()									//主函数			
{										//函数开始
	cout<<"姓名：谭浩强\n";				// 输出姓名
	cout<<"学号：201399999\n";			// 输出学号
	cout<<"---------------------------\n";			// 以下六行输出唐诗图案
	cout<<"          登鹳雀楼\n";
	cout<<"           王之涣\n";
	cout<<"         白日依山尽\n";
	cout<<"         黄河入海流\n";
	cout<<"         欲穷千里目\n";
	cout<<"         更上一层楼\n";
	cout<<"---------------------------\n";

	return 0;								// 程序执行完毕返回
}										//函数结束
